[["Most Wanted suspect accused of weapons violations sought by Dayton Police", "https://dayton247now.com/news/local/most-wanted-suspect-accused-of-weapons-violations-sought-by-dayton-police", "DAYTON, Ohio (WKEF) -- Police are asking for help finding a Most Wanted  suspect. Dayton Police have identified James Carl, 34,...", "Feb 16, 2023", "website accessibility\n\nThu, 19 Oct 2023 15:58:14 GMT (1697731094307)\n\n120bac95e121d08ae964d5c5bff9c3e7f11cbda8\n\n0ee03662a9d2249ac3a2e22180eed3c2ac69879b\n\nNews\n\nWeather\n\nGood Day Dayton\n\nYour Day\n\nGame Center\n\nWatch\n\nNow 58 Fri 60 Sat 59\n\nMost Wanted suspect accused of weapons violations sought by Dayton Police\n\nby Joshua Richardson\n\nJames Carl (DPD photo)\n\nDAYTON, Ohio (WKEF) -- Police are asking for help finding a Most Wanted suspect.\n\nDayton Police have identified James Carl, 34, as a Miami Valley Crime Stoppers Most Wanted suspect for having weapons under disability, improper handling of a firearm in a motor vehicle and receiving stolen property (firearm).\n\nIf you have information on Carl's whereabouts, you're asked to call Dayton Police at 937-333-2677 (333-COPS) or, to remain anonymous, call Crime Stoppers at 937-222-7867 (222-STOP).\n\nLoading ..."], ["At least a dozen Biden relatives will be exposed in foreign-money deals: \nJames Comer", "https://nypost.com/2023/04/23/at-least-a-dozen-biden-relatives-will-be-exposed-in-foreign-money-deals-james-comer/", "Rep. James Comer said the number of implicated Biden family members will  jump from 9 to at least 12, with the president's son Hunter and...", "Apr 23, 2023", "Breaking News\n\nRep. Jim Jordan will back Patrick McHenry as temporary House speaker amid deadlock — follow The Post's live coverage\n\nNews\n\nFacebook\n\nTwitter\n\nFlipboard\n\nWhatsApp\n\nEmail\n\nCopy\n\n\n\n\n\nAt least a dozen Biden relatives will be exposed in foreign-money deals: James Comer\n\n\n\tBy\n\t\n\nCarl Campanile\n\nSocial Links for Carl Campanile\n\nView Author Archive\n\nemail the author\n\nGet author RSS feed\n\nContact The Author\n\n(required)\n\n(required)\n\n(required)\n\nSubmit\n\nThanks for contacting us. We've received your submission.\n\nBack to Reading\n\nPublished\n\nApril 23, 2023\n\nUpdated\n\nApril 23, 2023, 8:53 p.m. ET\n\nMore On:\n\t\t\t\t\t\t\t\n\t\t\t\t\tjoe biden\n\nChilling new image shows Israeli hostage with terrorist captor after cooking for Hamas\n\nState Department official resigns over Biden’s support of Israel’s war against Hamas\n\nOver 100 migrants deported from US to Venezuela as repatriation flights resume\n\nBiden to deliver Oval Office speech Thursday about Israel-Hamas war and Ukraine\n\nEven more relatives of President Biden — or at least a dozen in all — will be exposed for having received money from foreign entities, the chairman of the House Oversight Committee said Sunday.\n\n“There’s not going to be anybody left for a Christmas picture if the [Department of Justice] did their job and went in there and indicted everyone that has any type of fingerprints involved in this influence-peddling scheme,” said Rep. James Comer (R-Kentucky) to Maria Bartiromo on Fox News’ “Sunday Morning Futures” show.\n\n“I mean, it’s the entire family,” Comer said. “And there isn’t a single one of those family members that had the ability to do anything to influence foreign policy other than the big guy, Joe Biden.”\n\nComer said the number of implicated Biden family members will jump from 9 to at least 12, with the president’s son Hunter and brother Frank’s foreign dealings just the tip of the iceberg.\n\nHe said his oversight committee is still reviewing bank records and “suspicious activity reports” that indicate members of the first family are benefiting from dealing with foreign entities through limited liability companies that seek to shield identities.\n\n“Through our informants and through our research over the past year and through other investigative reporting, we thought there were around a dozen of these LLCs that were created by Biden family members to disguise or launder where the source of the revenue was coming from,” Comer said.\n\nAP Photo/Alex Brandon\n\n“But there are many more LLCs. There are many more Biden members … and many more countries that were involved.”\n\nComer said the business dealings involve countries more unsavory than communist China.\n\n“I will say this: China was probably the most reputable country that the Biden family was dealing with,” he said.\n\nThe congressman even suggested that Biden family members may have broken the law by acting as “foreign agents” while not registering as lobbyists to do so.\n\nREUTERS/Kevin Lamarque\n\n“There’s no rhyme or reason for some of these Biden family members to receive any type of payment from our adversaries around the world, much less the number that we have uncovered. And we’re still digging through these bank violations,” he said.\n\nComer said he’s reviewing six actions that Biden made as president or former vice president which he claimed “could potentially lead back to payments that were made to these LLCs that were then laundered down to the Biden family members.”\n\nsee also\n\nSix more Bidens may have gained from family business schemes: Comer\n\nHe said that ultimately, the probe leads back to Joe Biden because his relatives did not have the power to provide favors to foreign entities or governments.\n\n“I haven’t found any legitimate business dealings on the Biden end. It looks like, if there wasn’t legitimate business dealing in any of these LLCs, it was influence-peddling. And if you want to get technical, and if you want to get to a legal term, that’s called being a foreign agent. They weren’t registered as a foreign agent,” Comer said of the Biden relatives.\n\nThe congressman also referred to new reports that lawyers for first son Hunter are scheduled to meet with Justice Department officials this week as part of the US Attorney’s Office in Delaware handling the drawn-out investigation into the president’s son.\n\nThe US Attorney’s Office in Delaware is reportedly considering four possible criminal charges that could slap Hunter Biden with two misdemeanor counts of failing to file taxes, a felony count of evading taxes relating to a business expense and lying about his drug use on a gun purchase form.\n\nThe congressman said team Biden is in a “pickle here” because “there’s no rhyme or reason why Hunter Biden shouldn’t have been indicted years ago, even before the last presidential election.”\n\nREUTERS/Kevin Lamarque\n\nHe said House Republicans have been able to crack open up the scandal with their own probe of Biden family business dealings.\n\n“It would be impossible for the Department of Justice to just cherry-pick Hunter Biden for an indictment and not do anything to [some] other Biden family members, because they were essentially doing the same thing and receiving the same types of payments from our adversaries around the world that Hunter Biden was doing,” Comer said.\n\nsee also\n\nHunter Biden lawyers to meet with DOJ officials next week: reports\n\n“There are more laws that appear to me that have been broken than just tax evasion. And there are a lot more Bidens involved than just the president’s son and his brother.”\n\nComer said the financial dealings involving China may be why the president is going soft on the communist adversary.\n\n“Nothing on COVID, nothing on Tik Tok, nothing on the spy balloon. China continues to steal our intellectual property. They continue to manipulate our currency,” he said of recent issues involving the communist world power.\n\n“And yet this president does nothing about China. It makes you wonder, Maria, whether or not he is in fact compromised because of the millions of dollars his family’s already taken in from the Chinese Communist Party.”\n\nThe White House had no immediate comment.\n\nLast week, Biden ignored a question when asked about the claim that family members benefited from foreign business deals.\n\nShare this article:\n\nFacebook\n\nTwitter\n\nFlipboard\n\nWhatsApp\n\nEmail\n\nCopy\n\n\n\n\n\nFiled under\n\nhouse oversight committee\n\nhunter biden\n\njoe biden\n\nus house of representatives\n\n4/23/23\n\nRead Next\n\nRussia 'will not forgive' after claiming US barred journal...\n\nTrending Now\t\t\t\n\t\t\t\ton NYPost.com\n\nThis story has been shared 75,562 times.\n\t\t\t\t\t\t\t75,562\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t4 college seniors fatally mowed down by out-of-control BMW driver in Malibu\n\nThis story has been shared 69,268 times.\n\t\t\t\t\t\t\t69,268\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tLetter from 2,000 actors and musicians slammed for accusing Israel of 'war crimes' while ignoring Hamas terrorist slaughter\n\nThis story has been shared 60,006 times.\n\t\t\t\t\t\t\t60,006\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tChilling new image shows Israeli hostage with terrorist captor after cooking for Hamas\n\nwhat to shop now\n\nThese 32 Halloween couples costume ideas are too good to ignore this year\n\nDress up this Halloween as Taylor Swift and Travis Kelce for costumes everyone will be talking about\n\nBest pop culture Halloween costumes of 2023, from 'Barbie' to 'Bridgerton'\n\nReady for an emergency? Expert survivalists swear by these emergency kits\n\nMake a splash with these expert-recommended inflatable hot tubs — the R&R your home needs\n\nNow on\n\t\t\t\t Page Six\n\nPregnant Kourtney Kardashian shows off baby bump in sheer dress\n\nQueen Camilla wears Queen Elizabeth’s favorite tiara for the first time after monarch’s death\n\nBritney Spears reveals ‘drug of choice’ from 2000s partying days\n\nSee All\n\nVideo\n\nWhat went wrong for the Liberty in their WNBA Finals loss to the Aces?\n\nNow on\t\t\t\t Decider\n\nAlyssa Farah Griffin Rips Congresswomen Ilhan Omar and Rashida Tlaib On ‘The View’ After They Blame Israel For Gaza Hospital Bombing\n\nSee All\n\nAP Photo/Alex Brandon\n\nREUTERS/Kevin Lamarque\n\nREUTERS/Kevin Lamarque\n\nYou are viewing\n\t\t\t\n\t\t\t\t1 of 3\n\t\t\t\n\t\timages\n\nPrevious Image\n\nNext Image\n\nAdvertisement"], ["CRIME STOPPERS: Trussville man wanted by Jefferson County Sheriff's Office", "https://www.trussvilletribune.com/2020/11/18/crime-stoppers-trussville-man-wanted-by-jefferson-county-sheriffs-office/", "From The Tribune staff reports BIRMINGHAM — The Jefferson County Sheriff's  Office is looking for a Trussville man wanted on felony warrants,...", "Nov 18, 2020", "Business Directory\n\nContact Us\n\nCareers\n\nBusiness Directory\n\nContact Us\n\nCareers\n\n\n\n\n\n\n\n\n\n\n\nHome\n\nShop Local\n\nNews Sections\n\n\tLocal News\n\tMetro, State, Nation\n\t\n\t\tLocal Deals\n\t\n\n\n\tBusiness\n\tLifestyle\n\tFood & Entertainment\n\tOpinion\n\tCommunity Events\n\nSports\n\nTrib TV\n\nObituaries\n\nE-Paper\n\nFeatures\n\n\tLocal Legal\n\tTribune Treasures\n\tIndustry Spotlight\n\tHome and Garden\n\tHealth and Wellness\n\tCommunity Events\n\tWheels and Water\n\nHome Services\n\nReaders Choice\n\nMenu\n\nHome\n\nShop Local\n\nNews Sections\n\n\tLocal News\n\tMetro, State, Nation\n\t\n\t\tLocal Deals\n\t\n\n\n\tBusiness\n\tLifestyle\n\tFood & Entertainment\n\tOpinion\n\tCommunity Events\n\nSports\n\nTrib TV\n\nObituaries\n\nE-Paper\n\nFeatures\n\n\tLocal Legal\n\tTribune Treasures\n\tIndustry Spotlight\n\tHome and Garden\n\tHealth and Wellness\n\tCommunity Events\n\tWheels and Water\n\nHome Services\n\nReaders Choice\n\nLATEST NEWS\n\nJoran van der Sloot admits he killed Natalee Holloway, pleads guilty to wire fraud, extortion\n\nMatthew Wade Roskam (July 29, 1965 — October 10, 2023)\n\nJeanne Leigh Walker (May 24, 1964 — October 15, 2023)\n\nAnna Sue Smith (July 18, 1930 — October 13, 2023)\n\nBrian Bly (July 30, 1969 — October 8, 2023)\n\nDeeDee Bly (May 25, 1963 — October 8, 2023)\n\nWoman died at Barber Motorsports from medical issue, not crash\n\nSean of the South: Italia\n\nSavvy Senior: Do you need life insurance after you retire?\n\nOctober 18 is Turn Trussville Pink\n\nHome\n\nCrime\n\nCRIME STOPPERS: Trussville man wanted by Jefferson County Sheriff’s Office\n\nCarl James Seals. Photo: Crime Stoppers of Metro Alabama.\n\nCRIME STOPPERS: Trussville man wanted by Jefferson County Sheriff’s Office\n\nPosted By: Online Editor\n\non: November 18, 2020\n\nIn: Crime, Local News\n\nPrint\n\nEmail\n\nFrom The Tribune staff reports\n\nBIRMINGHAM — The Jefferson County Sheriff’s Office is looking for a Trussville man wanted on felony warrants, according to Crime Stoppers of Metro Alabama.\n\nCarl James Seals, 34, is wanted on charges of domestic violence second-degree and theft of property first-degree. His last known address was in the 2000 block of Enclave Drive, in Carrington Lakes.\n\nSeals was listed as wanted as of Nov. 16, 2020.\n\nIf you have information on his whereabouts, you are asked to call Crime Stoppers of Metro Alabama at (205) 254-7777. You will remain anonymous and could be eligible for a cash reward.\n\nShare on Facebook\n\t\t\t\t\t\t\t\tShare\n\nTags:\n\nCrime Stoppers\n\ndomestic violence\n\ntheft\n\nTrussville\n\nWanted\n\nShare\n\nTweet\n\nShare\n\nShare\n\nPrevious\n                            Alabama man convicted of killing ex-wife after divorce\n\nNext\n                            Birmingham man charged with murder in Walker County\n\nAbout the author\n\nOnline Editor\n\n\n\n\n\nRelated Articles\n\nJoran van der Sloot admits he killed Natalee Holloway, pleads guilty to wire fraud, extortion\n                        \n\t\t\tOctober 18, 2023\n\nWoman died at Barber Motorsports from medical issue, not crash\n                        \n\t\t\tOctober 18, 2023\n\nOctober 18 is Turn Trussville Pink\n                        \n\t\t\tOctober 17, 2023\n\nTribune Unscripted\n\nCopyright © All rights reserved. Trussville Tribune"], ["Meet Carl Marlinga & John James: Previewing MI's 10th Congressional \nDistrict race", "https://www.wxyz.com/news/democracy-2022/meet-carl-marlinga-john-james-previewing-mis-7th-congressional-district-race", "John James and Carl Marlinga face off in Michigan's newly-drawn 10th  District, which covers a large portion of Macomb County and some parts...", "Nov 2, 2022", "America Votes\n\nActions\n\nFacebook\n\nTweet\n\nEmail\n\nMeet Carl Marlinga & John James: Previewing MI's 10th Congressional District race\n\nPrev\n\nNext\n\nJohn James and Carl Marlinga face off in Michigan's newly-drawn 10th District, which covers a large portion of Macomb County and some parts of Oakland County.\n\nBy:\n\nBrett Kast\n\nPosted at 12:25 PM, Nov 02, 2022\n\nand last updated\n\n2022-11-03 18:07:18-04\n\nAfter spending nearly 40 years as a prosecutor, attorney and judge, Democrat Carl Marlinga is making a run for Congress. He's facing a fellow newcomer who is a familiar face in the Republican party, John James, a businessman and a veteran who has run for the U.S. Senate twice.\n\nThe two will face off in Michigan's newly-drawn 10th District, which covers a large portion of Macomb County and some parts of Oakland County including Rochester and Rochester Hills. I met with both candidates ahead of the election to talk about the issues.\n\nMarlinga is a former Macomb County judge, a prosecutor and a U.S. Assistant Attorney. During his career, he said he set up special units for sexual assault victims, elder abuse, and established a mental health court. He has also done work with The Innocence Project.\n\n\"I've been have been proud of my work as a judge. I've been very proud of my work as a prosecutor and been very proud of my work as a defense attorney. The whole goal being to maximize justice in the system,\" he said.\n\nJames, his opponent, is an army veteran and West Point grad who now serves as president of his family's logistics company. He's a married father of three who lost two races for U.S. Senate in 2018 and 2020.\n\n\"Somebody who understands national security is somebody who can help make our nation safer and somebody who understands supply chain management, especially in this district, which will be the number one manufacturing district in the nation,\" he said.\n\nWhen it comes to the economy and inflation, Marlinga said the U.S. needs to become more energy-independent and believes the key is to produce more clean, renewable energy in the U.S. while adding jobs.\n\n\"Even moving in that direction is going to have an effect on gas prices, because if the OPEC countries know that there is a serious chance that we can divest ourselves entirely from the need for oil and gas, they will not hold us up as they have in the past,\" Marlinga said.\n\nJames scolded the Biden administration for giving an additional $80 million in funding for the IRS, saying he wants to lower taxes.\n\nWe should be allowing more folks to achieve the American dream. And I'm going to be doing everything I can to allow folks to work for themselves, lower taxes, and make sure we can keep our community safer,\" James said.\n\nOther issues they differed on were abortion. James said he's anti-abortion and against Proposal 3, while Marlinga is for abortion rights and supports Proposal 3.\n\nAs for gun control, Marlinga called for red flag laws, raising the age to purchase a gun to 21, and restrictions on high-capacity weapons.\n\n\"There is no reason why weapons of war like that should be in the hands of ordinary people,\" Marlinga said.\n\n\"We absolutely have to keep our promise to keep our community safer, to keep our children safe. But also we have to keep our promise to uphold the Bill of Rights in our Constitution,\" James said.\n\nWhen it came to police funding, both candidates had a similar answer.\n\n\"Well, instead of defunding the police, we have to fund the police. What we have to do is to make sure that our police organizations are fully funded to have their traditional duties, but also to have additional staff to be able to deal with the underlying social causes of crime,\" Marlinga said.\n\n\"We must support our police. We must make sure that communities have the resources they need to stay safe. We must secure our border. We must make sure that we lower crime,\" James said.\n\nWatch their entire interviews below\n\nOne-on-one with Republican John James on Michigan's 10th Congressional District race\n\nOne-on-one with Democrat Carl Marlinga on Michigan's 10th Congressional District race\n\nCopyright 2022 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nSign up for the Morning Newsletter and receive up to date information.\n\nnow signed up to receive the Morning Newsletter.\n\nClick here to manage all Newsletters\n\nMichigan Voter Resources and Information\n\nCheck if you're registered to vote in Michigan\n\nHow to register to vote in Michigan\n\nFind your polling location\n\nHow to get an absentee ballot\n\nView your sample ballot"], ["Traffic stops in East Idaho result in felony drug arrests", "https://www.idahostatejournal.com/townnews/criminal_law/traffic-stops-in-east-idaho-result-in-felony-drug-arrests/article_e5e5a31c-86db-11ed-8f9c-eb4582cab77a.html", "At approximately 11pm on December 26th, a Bonneville County Sheriff's  Deputy stopped a vehicle with no license plate at the intersection of...", "Dec 28, 2022", "Skip to main content\n\nYou have permission to edit this article.\n\nEdit\n\nClose\n\nFacebook\n\nTwitter\n\nInstagram\n\nSearch\n\nSign Up\n\nLog In\n\nDashboard\n\nLogout\n\nMy Account\n                     Dashboard\n                     Profile\n                     Saved items\n                    \n                    \n                        \n                         Logout\n\nSUBSCRIBE\n\nHome\n\nNews\n\nCommunity\n\nLocal\n\nState\n\nNational\n\nWorld\n\nSpecial Sections\n\nEast Idaho Business Journal\n\nEast Idaho Outdoors\n\nCrimes & Court\n\ne-Edition\n\nPhotos\n\nVideos\n\nSports\n\nLocal\n\nISU\n\nHigh School\n\nGate City Grays\n\nNational\n\nOpinion\n\nColumns\n\nLetters to the editor\n\nEditorials\n\nObituaries\n\nPlace an Obituary\n\nToday's Obituaries\n\nLocal Events\n\nPromote Your Event\n\nFamily Fun Day\n\nReaders Choice\n\nKids Matter\n\nContests\n\nClassifieds\n\nIdahoJobsNow\n\nJob Search\n\nHomes\n\nPlace a classified ad\n\nLegal Notices\n\nShop Local\n\nHealthy City, USA\n\nAbout Us\n\nContact\n\nAdvertise with us\n\nMedia Kit\n\nBecome A Carrier\n\nIdaho State Journal\n\nBusiness Journal\n\nPreps\n\nFarm & Ranch\n\nEast Idaho Outdoors\n\nNewsletter sign up\n\nArchives\n\nLatest E-Edition\n\nIdaho State Journal\n\nManage Your Subscription\n\nThursday, October 19, 2023\n\nPrint Edition\n\ne-Edition How-To\n\nFacebook\n\nTwitter\n\nInstagram\n\n51°\r\n                    \r\n                        Sunny\n\nMenu\n\nSearch\n\nSite search\r\n        \r\n        \r\n        \r\n            \r\n                \r\n\t                \r\n\t            \r\n                Search\n\nOpen user controls\n                    \n                    \n                        \n                            \n                                \n                                    \n                                        Log In Using Your Account\n                                        Log In\n                                    \n                                \n                                \n                                    \n                                        Don't have an account? Sign Up Today\n\nMy Account\n                     Dashboard\n                     Profile\n                     Saved items\n                    \n                    \n                        \n                         Logout\n\nSign Up\n\nLog In\n\nDashboard\n\nLogout\n\nMy Account\n                     Dashboard\n                     Profile\n                     Saved items\n                    \n                    \n                        \n                         Logout\n\nSUBSCRIBE\n\nHome\n\nNews\n\nSports\n\nOpinion\n\nObituaries\n\nEvents\n\nContests\r\n                \r\n                \r\n                    Readers' Choice 2023\r\n                \r\n                \r\n                    Kids Matter 2023\n\nClassifieds\r\n                \r\n                \r\n                    East Idaho Careers\n\nShop Local\n\nHealthy City, USA\n\nClose\n\nRiki Jo Vanbrocklin\n\nFacebook\n\nTwitter\n\nWhatsApp\n\nSMS\n\nEmail\n\nPrint\n\nCopy article link\n\nSave\n\nCarl James Eckenrode\n\nFacebook\n\nTwitter\n\nWhatsApp\n\nSMS\n\nEmail\n\nPrint\n\nCopy article link\n\nSave\n\nKimberly Ray Hill\n\nFacebook\n\nTwitter\n\nWhatsApp\n\nSMS\n\nEmail\n\nPrint\n\nCopy article link\n\nSave\n\ntop story\n\nTraffic stops in East Idaho result in felony drug arrests\n\nBonneville County Sheriff’s Office\nNews release\r\n        \r\n        \r\n            \r\n        \r\n            Dec 28, 2022\r\n        \r\n            Dec 28, 2022\r\n        Updated \r\n        Dec 28, 2022\r\n    \r\n        \r\n        \r\n             0\n\nFacebook\n\nTwitter\n\nWhatsApp\n\nSMS\n\nEmail\n\nRiki Jo Vanbrocklin\n\nFacebook\n\nTwitter\n\nWhatsApp\n\nSMS\n\nEmail\n\nPrint\n\nCopy article link\n\nSave\n\nAt approximately 11pm on December 26th, a Bonneville County Sheriff’s Deputy stopped a vehicle with no license plate at the intersection of John Adams Parkway and Croft Dr. The Deputy identified the driver as 26 year old Riki Jo Vanbrocklin of Idaho Falls, along with an adult male passenger in the vehicle. While obtaining identifying information on the vehicle, the Deputy observed drug paraphernalia inside the vehicle. A search of Ms. Vanbrocklin’s coat and wallet produced a vape pen that she admitted was used for smoking THC and a small baggie with over 2 grams of methamphetamine. Vanbrocklin admitted to Deputies she was holding the methamphetamine for a friend.\n\nMs. Vanbrocklin was placed under arrest and transported to the Bonneville County Jail where she was booked for Felony Possession of Methamphetamine.\n\nAt approximately 11pm last night (Dec. 27th), Bonneville County Deputies were dispatched to a report of suspicious activity with people inside a vehicle behind the businesses located in the 2000 S. block of 25th E. in Ammon. Deputies arrived and located the vehicle, identifying 43 year old Carl James Eckenrode as the driver. A female passenger who provided a false name was also in the vehicle and Deputies were later able to confirm her identify as 32 year old Kimberly Ray Hill.\n\nCarl James Eckenrode\n\nMr. Eckenrode was familiar to Deputies as being on Probation and having prior Law Enforcement contacts. At the request of his Probation Officer, Deputies searched Mr. Eckenrode’s vehicle locating items of drug paraphernalia and just over 8 grams of Methamphetamine in the driver seat area. During the search of the vehicle, Deputies found items and an identification card that confirmed Ms. Hill’s identity. A check through dispatch confirmed Ms. Hill had an active Misdemeanor Warrant out of Bonneville County for Failure to Appear at a court hearing.\n\nKimberly Ray Hill\n\nBoth Eckenrode and Hill were placed under arrest and transported to the Bonneville County Jail. Mr. Eckenrode was booked for Felony Possession of Methamphetamine and Misdemeanor Possession of Drug Paraphernalia. Ms. Hill was booked into jail on the outstanding Warrant and Misdemeanor Providing False Information to Law Enforcement.\n\nFacebook\n\nTwitter\n\nWhatsApp\n\nSMS\n\nEmail\n\nPrint\n\nCopy article link\n\nSave\n\nTags\n\nVehicle\n\nCarl James Eckenrode\n\nCriminal Law\n\nLaw\n\nCrime\n\nBonneville County\n\nMethamphetamine\n\nRiki Jo Vanbrocklin\n\nParaphernalia\n\nKimberly Ray Hill\n\nFeatured Local Savings\n\nRecommended for you\n\nPost a comment as anonymous\n\nEmoticons\n\n[smile]\n\n[beam]\n\n[wink]\n\n[sad]\n\n[cool]\n\n[innocent]\n\n[rolleyes]\n\n[whistling]\n\n[lol]\n\n[huh]\n\n[tongue]\n\n[love]\n\n[sleeping]\n\n[yawn]\n\n[unsure]\n\n[angry]\n\n[blink]\n\n[crying]\n\n[ohmy]\n\n[scared]\n\n[sleep]\n\n[sneaky]\n\n[tongue_smile]\n\n[thumbdown]\n\n[thumbup]\n\n[censored]\n\n[happybirthday]\n\n[ban]\n\n[spam]\n\n[offtopic]\n\n[batman]\n\n[ninja]\n\n[pirate]\n\n[alien]\n\nYour comment has been submitted.\n\nReport\n\nReported\n\nThere was a problem reporting this.\n\nWatch this discussion.\n                    Stop watching this discussion.\n\nGet an email notification whenever someone contributes to the discussion\n\nNotifications from this discussion will be disabled.\n\nStart watching\n\nStop watching\n\n(0) comments\n\nWelcome to the discussion.\n\nLog In\n\nThe Idaho State Journal invites you to take part in the community\nconversation. But those who don't play nice may be uninvited.\nDon't post comments that are off topic, defamatory, libelous,\nobscene, racist, abusive, threatening or an invasion of privacy. We\nmay remove any comment for any reason or no reason. We encourage\nyou to report abuse, but the decision to delete is ours. Commenters\nhave no expectation of privacy and may be held accountable for\ntheir comments. Comments are opinions of the author only, and do\nnot reflect the opinions or views of Idaho State Journal.\n\nPost a comment\n\nWatch this discussion.\n                                    Stop watching this discussion.\n\nEmployment Opportunities!\n\nTrending Now\n\nPolice: Local man arrested for holding woman against her will, endangering lives of two young children\n\n‘Unusually large’ toxic algal bloom covers 30-mile stretch of the Lower Snake River\n\nLocal man sentenced to over 44 years in federal prison for videotaping his rape of handicapped child\n\nExtreme Rush to break ground on sprawling family fun center next week\n\nAmerican Falls' Mata turns unexpected coaching stint into 'beautiful family'\n\nBannock County again denies proposed gravel pit after appeal\n\nIdaho State University breaks enrollment, retention records\n\nLocal man arrested after allegedly attacking PMC nurse\n\nDon Aslett: The Don Juan of the John\n\n2 airlifted to hospitals after crash near Twin Falls\n\nLatest e-Edition\n\nTo view our latest e-Edition, click the image on the left.\n\nMyIdahoTix.com\n\nNewsletter Signup\n\nSign up today, or manage your subscriptions, to one of our great newsletters:\n\nSpecial Offers\n\nDaily Headlines\n\nand much more!\n\nGet your e-Newsletters\n\n208-232-4161\n\nreporters@journalnet.com\n\nFacebook\n\nTwitter\n\nYouTube\n\nSubscribe Today!\n\nManage your subscription\n\nReport a delivery issue\n\nPay your bill\n\nVacation stop\n\nSign up for our daily email alerts\n\nContact Us\n\nCall us at 208-232-4161\n\nor send an email\n\nGet in touch with the Journal\n\nCommon Submissions\n\nSend a Letter to the Editor\n\nSubmit an Obituary\n\nPromote Your Event\n\nAdvertising\n\nPlace a Classified Ad\n\nMilestones Announcements\n\nSubmit your milestone. From anniversaries to weddings.\n\nBrowser Compatibility\n\nYour browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:\n\nMicrosoft Edge\n\nGoogle Chrome\n\nFirefox\n\nFooter Offer Promo\n\nCARRIERS NEEDED!\n\nLocal News Worth Delivering\n\nBecome a newspaper carrier for the Idaho State Journal and earn extra cash!\n\nApply Today!\n\n© Copyright 2023\n\nIdaho State Journal\n\n305 S. Arthur, Pocatello, ID\n\nTerms of Use\n\n| Privacy Policy\n\nBLOX Content Management System from\n\nBLOX Digital.\n\nBack\n\nSorry, an error occurred.\n\nGet Started\n\nLog In\n\nSign Up\n\nYou are logged in \n\nSwitch accounts\n\nBack\n\nSign Up\n\nThis is the name that will be displayed next to your photo for comments, blog posts, and more. Choose wisely!\n\n* Password\n                                \n                                    \n                                    Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address.\n\nEmail Address\n\nYour email address will be used to confirm your account. We won't share it with anyone else.\n\n* Confirm Password\n                                \n                                    \n                                    Confirm your password.\n\nPassword\n\nCreate a password that only you will remember. If you forget it, you'll be able to recover it using your email address.\n\nConfirm Password\n\nConfirm your password.\n\nor\n\nSign up with\n\nNewzware\n\nHave an account? Log In\n\nYou're all set!\n\nThank you .\n\nYour account has been registered, and you are now logged in.\n\nCheck your email for details.\n\nOK\n\nBack\n\nLog In\n\nInvalid password or account does not exist\n\nForgot your password?\n\nEmail me a log in link\n\nor\n\nSign in with\n\nNewzware\n\nSubscribe\n\nNeed an account? Sign Up\n\nBack\n\nReset Password\n\nSubmitting this form below will send a message to your email with a link to change your password.\n\nForgot Password\n\nAn email message containing instructions on how to reset your password has been sent to the email address listed on your account.\n\nBack\n\nEmail me a log in link\n\nBack\n\nPromotional Offers\n\nRedeem\n\nNo promotional rates found.\n\nBack\n\nPurchase Gift\n                            Purchase Access\n\nSee More Offers\n\ndetails\n\nclose\n\nSecure & Encrypted\n\nContinue with Email Address\n\nor\n\nContinue with Newzware\n\nYou are logged in \n\nSwitch accounts\n\n\n                        Subtotal: \n\n\n                        Total: \n\nEnding in\n\nAdd New Card\n\nMonth\n\nI Agree to the Subscription Terms of Use.\n\nSecure transaction.\n            Secure transaction. Cancel anytime.\n\nYou're all set!\n\nThank you.\n\nYour gift purchase was successful!\n                                        Your purchase was successful, and you are now logged in.\n\nRate:\n\nBegins:\n\nTransaction ID:\n\nA receipt was sent to your email.\n\nOK\n\nAn error occurred\n\nThis offer is currently unavailable."]]