[["Police on scene as three people arrested on suspicion of murder", "https://www.sthelensstar.co.uk/news/23748725.police-scene-three-people-arrested-suspicion-murder/", "At around 1.30am on Tuesday, August 22, officers received a report from the  North West Ambulance Service that a 54 year-old man had been...", "1 month ago", "Newsletters\n\nJobs\n\nHomes\n\nCars\n\nBook An Ad\n\nLocal listings\n\nLocal info\n\nContact us\n\nMore\n                \n                    \n                        \n                    \n                    \n                        \n                    \n\n                    \n                        \n                            Newsletters Jobs Homes Cars Book An Ad Local listings Local info Contact us\n\nSubscribe\n\nPuzzles\n\nSign in\n\nClose\n\nSearch\n\nNews\n\nVideo News\n\nCrime\n\nBusiness\n\nSport\n\nSaints\n\nAmateur Rugby League\n\nRugby Union\n\nFootball\n\nBoxing\n\nCricket\n\nJunior sport\n\nGeneral Sport\n\nUK Sport News\n\nSaints\n\nWhat's On\n\nLeisure\n\nWhat's On\n\nShowbiz News\n\nEvents\n\nAnnouncements\n\nAcknowledgements\n\nDeath Notices\n\nIn Memoriam\n\nPublic notices\n\nOther announcements\n\nE-Edition\n\nContact Us\n\nMediapack\n\nLeaflets\n\nTrue Crime UK\n\nPuzzles\n\nNewsletters\n\nJobs\n\nHomes\n\nCars\n\nBook An Ad\n\nLocal listings\n\nLocal info\n\nContact us\n\nNews\n                \n\n\n                \n                    Sport\n                \n\n\n                \n                    Saints\n                \n\n\n                \n                    What's On\n                \n\n\n                \n                    Events\n                \n\n\n                \n                    Announcements\n                \n\n\n                \n                    E-Edition\n                \n\n\n                \n                    Contact Us\n                \n\n\n                \n                    True Crime UK\n                \n            \n            \n                More\n\nNews\n\nVideo News\n\nCrime\n\nBusiness\n\nPolice on scene as three people arrested on suspicion of murder\n\nPolice on scene as three people arrested on suspicion of murder\n\nCrime\n\nBy \n            Simon Mulligan\n\n@SimonJMulligan1\n\nSenior Reporter\n\nShare\n\nPolice at the scene (Image: St Helens Star)\n\nTHREE people have been arrested on suspicion of murder after a man died after an assault.\n\nAt around 1.30am on Tuesday, August 22, officers received a report from the North West Ambulance Service that a 54 year-old man had been assaulted on Brookhouse Grove in Eccleston.\n\nHe was taken to hospital for treatment for his injuries. He was spoken to at the hospital by officers and then later discharged.\n\nThe following day, Wednesday, August 23, at around 3.30pm, the same man collapsed inside a property on Brookhouse Grove.\n\nHe was taken to hospital where he was pronounced dead.\n\nREAD > Arrests at St Helens addresses as part of domestic abuse crackdown\n\nA post mortem has taken place to establish the cause of death. The man’s family is aware and are being supported by specially trained officers.\n\nAn investigation is underway and inquiries are ongoing.\n\nTwo men aged 54 and 42 years, and a 29-year-old woman were arrested on suspicion of murder.\n\nThey have been released on conditional bail pending further inquiries.\n\nPolice on Brookhouse Grove on Friday evening  (Image: St Helens Star)\n\nCCTV and witness enquiries are being carried out, and anyone with any information is asked to contact police.\n\nAnyone in the area with information, CCTV or dashcam can contact police on 101 or Facebook ‘Merseyside Police Contact Centre’ with reference 23000791888.\n\nYou can also contact the independent charity Crimestoppers anonymously on 0800 555 111.\n\nCrime\n\nShare\n\nComments: Our rules\n\nWe want our comments to be a lively and valuable part of our community - a place where readers can debate and engage with the most important local issues. The ability to comment on our stories is a privilege, not a right, however, and that privilege may be withdrawn if it is abused or misused.\n\nPlease report any comments that break our rules.\n\nRead the rules here\n\nComments have been closed on this article.\n\nGet involved\n        with the news\n\nSend your news & photos\n\nLoading...\n\nLoading...\n\nContact us\n\nManage Consent\n\nAnnouncements\n\nLeap\n\nCookie Policy\n\nTerms & Conditions\n\nContributor Terms\n\nNewsquest printing\n\nAdvertise\n\nNewsletters\n\nReader Rewards\n\nSite Map\n\nExchange and Mart\n\nTerms of Advertising\n\nPrivacy Policy\n\nDiversity Statement\n\nPhoto Sales\n\nOur Publications\n\nArchive\n\nAdd Your Event For Free\n\nfollow us\n\nSt Helens Star\n\n@sthelensstar\n\nSt Helens Star\n\nThis website and associated newspapers adhere to the Independent Press Standards Organisation's\n    Editors' Code of Practice. If you have a complaint about the editorial content which relates to\n    inaccuracy or intrusion, then please \n    contact the editor here.\n    If you are dissatisfied with the response provided you can\n    contact IPSO here\n\n© 2001-2023. This site is part of Newsquest's audited local newspaper network. A Gannett Company. Newsquest Media Group Ltd, 1st Floor, Chartist Tower, Upper Dock Street, Newport, Wales, NP20 1DW Registered in England & Wales | 01676637 |\n\nModal headline\n\nClose\n\nAutomatically injected HTML goes here\n\nData returned from the Piano 'meterActive/meterExpired' callback event.\n\nAs a subscriber, you are shown 80% less display advertising when reading our articles.\n\nThose ads you do see are predominantly from local businesses promoting local services.\n\nThese adverts enable local businesses to get in front of their target audience – the local community.\n\nIt is important that we continue to promote these adverts as our local businesses need as much support as possible during these challenging times."], ["Acton Town tower block would create concrete jungle, residents say", "https://www.bbc.co.uk/news/uk-england-london-64381453", "Women's Pioneer Housing wants to build a 15-storey tall women-only block in  Acton Town.", "Jan 24, 2023", "Acton Town tower block would create concrete jungle, residents say\n\nPublished24 January\n\nShare\n\nclose panel\n\nShare page\n\nCopy link\n\nAbout sharing\n\nImage source, Women's Pioneer Housing Ltd\n\nImage caption,\n\nWomen's Pioneer Housing said it was \"vital\" to provide women with affordable good-quality housing\n\nBy Megan Stanley\n\nLocal Democracy Reporting Service\n\nA 15-storey tall women-only tower block which has been proposed to be built in west London would turn the area into a \"concrete jungle\", locals have warned.\n\nWomen's Pioneer Housing wants to build the 102-home block opposite Acton Town London Underground station.\n\nOne resident said it could turn Acton Town into a \"concrete jungle - devoid of soul and heart\".\n\nThe housing association said it was \"critical\" to provide women with good-quality, affordable homes.\n\nInside the UK's biggest self-build development\n\nPlans approved to bulldoze Aylesbury Estate flats\n\nCompetition for homes drives up London rents\n\nThe housing association wants to build the tower in place of Brook House - a five-storey block containing \"low-quality\" flats.\n\nThe building would consist of a mix of one-bed and two-bed flats, which the Hammersmith and Fulham-based association says would be 100% affordable and only available to women.\n\nImage source, Women's Pioneer Housing Ltd\n\nImage caption,\n\nThe plans have met fierce opposition from some residents\n\nThe application on Ealing Council's website has had 48 people oppose it, while nine have voiced support for the plans.\n\nOne objector wrote: \"Another horrible tall building to blite (sic) our old Acton Town. The area is turning into a horrible high-rise.\"\n\nMeanwhile, a supporter said: \"I am aware that life circumstances can change in an instant, so the plan to offer 100 women renewed lives has to be good. This project has my wholehearted support.\"\n\n'Critically important'\n\nMill Hill Park Residents' Association has also voiced concerns about the proposals.\n\nSecretary Corinna Stowell said it was worried \"about the massing and the height of the proposed building, and particularly its 15-storey section\".\n\nTracy Downie, chief executive of Women's Pioneer Housing, said \"providing more good-quality, affordable homes for women is critically important, particularly during this cost-of-living and energy crisis\".\n\nShe added that existing properties at Brook House were \"small, energy inefficient, and nearing the end of their build-life with no viable option for refurbishment\".\n\n\"We acknowledge some resident's concerns over height, we have also been encouraged by the number of positive comments which welcome the need for more social and affordable housing for women in the area,\" she said.\n\nEaling Council is due to make a decision about the proposals at a later date.\n\nFollow BBC London on Facebook, Twitter and Instagram. Send your story ideas to hellobbclondon@bbc.co.uk\n\nRelated Topics\n\nHousing\n\nAffordable housing\n\nLondon\n\nEaling\n\nActon\n\nMore on this story\n\nRents and house prices continue to risePublished18 January\n\nProtesters storm council meeting over housing crisisPublished17 January\n\nRough sleepers in London up by nearly a quarterPublished30 October 2022\n\nRelated Internet Links\n\nEaling Council\n\nThe BBC is not responsible for the content of external sites."], ["Plans for new Starbucks drive-thru in town centre lodged", "https://www.theoldhamtimes.co.uk/news/23256867.plans-new-starbucks-drive-thru-oldham-town-centre/", "The Brookhouse Group has lodged an application with the council to build a  branch of the global coffee chain at Alexandra Centre Retail Park...", "Jan 17, 2023", "Newsletters\n\nJobs\n\nHomes\n\nMotoring\n\nLocal listings\n\nBook An Ad\n\nLocal info\n\nMore\n                \n                    \n                        \n                    \n                    \n                        \n                    \n\n                    \n                        \n                            Newsletters Jobs Homes Motoring Local listings Book An Ad Local info\n\nContact Us\n\nSign in\n\nClose\n\nSearch\n\nNews\n\nCrime\n\nLatics\n\nSport\n\nLatics\n\nRoughyeds\n\nAvro FC\n\nFootball\n\nOther Sport\n\nAnnouncements\n\nAcknowledgements\n\nDeath Notices\n\nIn Memoriam\n\nPublic notices\n\nOther announcements\n\nLocal Events\n\nContact Us\n\nNewsletters\n\nJobs\n\nHomes\n\nMotoring\n\nLocal listings\n\nBook An Ad\n\nLocal info\n\nNews\n                \n\n\n                \n                    Latics\n                \n\n\n                \n                    Sport\n                \n\n\n                \n                    Announcements\n                \n\n\n                \n                    Local Events\n                \n            \n            \n                More\n\nNews\n\nCrime\n\nPlans for new Starbucks drive-thru in town centre lodged\n\nPlans for new Starbucks drive-thru in Oldham town centre\n\nFood and drink\n\nLeisure\n\nPlanning and development\n\nBy \n            Charlotte Green\n\n@CharGreenLDR\n\nLocal Democracy Reporter\n\nShare\n\nHow the new Starbucks drive-thru in Oldham could look. Photo: Brookhouse Group Ltd (Image: Brookhouse Group Ltd)\n\nA new Starbucks drive-thru could be opening on a car park on the edge of Oldham town centre.\n\nThe Brookhouse Group has lodged an application with the council to build a branch of the global coffee chain at Alexandra Centre Retail Park.\n\nThe land earmarked for development on Park Road is currently used as a car park.\n\nThe new Starbucks would be located south of the Pure Gym and Matalan store which are currently on the site, along with Home Bargains, Shoe Zone, JYSK and Iceland.\n\nAccording the planning documents, the drive-thru building would be single storey and be ‘significantly smaller’ that the neighbouring units, with landscaping provided around it.\n\nThe development would see a loss of 41 spaces from the corner of the current car park, reducing it to 42 spaces including two disabled bays and cycling stands.\n\nDocuments submitted with the application state: “The owner of this site has seen an opportunity to add to the Alexandra Retail Park. The existing car park is large enough that a corner can be utilized for a small pod unit.”\n\nThe transport assessment states that it is predicted that the new Starbucks would generate 65 two way car trips during the weekday morning peak, and up to 69 in the Saturday peak.\n\n“The pod unit is expected to generate a limited number of ‘new’ trips and would principally act as a complementary facility to the existing retail park,” Hydrock, the transport assessment company states.\n\nStarbucks had previously applied to open a new branch at the Elk Mill Central Retail Park on Broadway in Royton.\n\nThere have been no objections or letters of support lodged over the Alexandra Centre application which was lodged this month.\n\nA decision on whether to approve the plans is expected by the end of March.\n\nFood and drink\n\nLeisure\n\nPlanning and development\n\nShare\n\nComments: Our rules\n\nWe want our comments to be a lively and valuable part of our community - a place where readers can debate and engage with the most important local issues. The ability to comment on our stories is a privilege, not a right, however, and that privilege may be withdrawn if it is abused or misused.\n\nPlease report any comments that break our rules.\n\nRead the rules here\n\nComments have been closed on this article.\n\nloading\n\nLast Updated:\n\nReport this comment\n\n                        Cancel\n\nEnter the above word in the box below\n\nCancel\n\nEdit comment\n\n                        Cancel\n\nAre you sure you want to delete this comment?\n\nCancel\n\nGet involved\n        with the news\n\nSend your news & photos\n\nLoading...\n\nLoading...\n\nContact us\n\nManage Consent\n\nAnnouncements\n\nLeap\n\nCookie Policy\n\nTerms & Conditions\n\nContributor Terms\n\nNewsquest printing\n\nAdvertise\n\nNewsletters\n\nSite Map\n\nExchange and Mart\n\nTerms of Advertising\n\nPrivacy Policy\n\nDiversity Statement\n\nPhoto Sales\n\nOur Publications\n\nArchive\n\nAdd Your Event For Free\n\nfollow us\n\nThe Oldham Times\n\n@theoldhamtimes\n\nThis website and associated newspapers adhere to the Independent Press Standards Organisation's\n    Editors' Code of Practice. If you have a complaint about the editorial content which relates to\n    inaccuracy or intrusion, then please \n    contact the editor here.\n    If you are dissatisfied with the response provided you can\n    contact IPSO here\n\n© 2001-2023. This site is part of Newsquest's audited local newspaper network. A Gannett Company. Newsquest Media Group Ltd, 1st Floor, Chartist Tower, Upper Dock Street, Newport, Wales, NP20 1DW Registered in England & Wales | 01676637 |\n\nModal headline\n\nClose\n\nAutomatically injected HTML goes here\n\nData returned from the Piano 'meterActive/meterExpired' callback event.\n\nAs a subscriber, you are shown 80% less display advertising when reading our articles.\n\nThose ads you do see are predominantly from local businesses promoting local services.\n\nThese adverts enable local businesses to get in front of their target audience – the local community.\n\nIt is important that we continue to promote these adverts as our local businesses need as much support as possible during these challenging times."], ["League first: Plate up with the JackJumpers", "https://www.themercury.com.au/sport/hobarts-jackjumpers-launch-limited-edition-nbl-number-plates/news-story/b89b2295ce9b2fc561eb844163505955", "JackJumpers fans can secure their very own limited edition number plate as  the club launches the NBL's first-ever vehicle licence plate...", "Jan 11, 2023", "with your subscription to\n\nFAQs\n\nLog In\n\nLeague first: Plate up with the JackJumpers\n\nThe Tasmania JackJumpers have launched the NBL’s first-ever vehicle licence plate program. Find out how to secure your own piece of memorabilia + cost of starting bid. >\n\nGet a read on this story\n\nBut it’s a member-only story. Subscribe today to unlock it and more…\n\nLeague first: Plate up with the JackJumpers\n\nThe Tasmania JackJumpers have launched the NBL’s first-ever vehicle licence plate program. Find out how to secure your own piece of memorabilia + cost of starting bid. >\n\nFull Digital Access\n\n$1 a week for the first 4 weeks.\r\nMin. cost $4. Conditions apply.*\n\nFull Digital Access\n\n$1 a week for the first 4 weeks.\r\nMin. cost $4. Conditions apply.*\n\nRead every story on web & app\n\nSubscriber-exclusive news emails straight to your inbox\n\nA digital version of Today’s Paper\n\nApp or digital edition only customer? To upgrade, call 1300 MY NEWS (696 397)\n\nChoose from one of our tailored subscription packages below.\n\nFull Digital Access\n\nFeatures\n\nNo lock-in contract\n\nPLUS\n\nUnlimited articles on web & app\n\nSubscriber-exclusive news emails\n\nEnjoy games & puzzles\n\nA digital version of Today’s Paper\n\n/WEEK\n\nRead the fine print\n\nTHINGS YOU NEED TO KNOW\n\nFull Digital Access $4 charged for the first 4 weeks, then $28 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. New customers only. Prices after the introductory pricing period may be varied as per full Terms and Conditions. See www.themercury.com.au/subscriptionterms for full details.\n\nLock in and save\r\nFull Digital Access 12 Month Plan\n\nFeatures\n\nSAVE 38% when you lock in for the first 12 months when compared to the above offer.\n\nPLUS\n\nUnlimited articles on web & app\n\nSubscriber-exclusive news emails\n\nEnjoy games & puzzles\n\nA digital version of Today’s Paper\n\n/WEEK\n\nRead the fine print\n\nTHINGS YOU NEED TO KNOW\n\nFull Digital Access 12 Month Plan costs $208 (min.cost) for the first 12 months, charged as $16 every 4 weeks. This automatically renews after the first 12 months to be charged as $16 (min. cost) every 4 weeks unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. A valid active email address and Australian mobile phone number are required for account set up. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.themercury.com.au/subscriptionterms for full details.\n\nFull Digital Access\n\nFull Digital Access\n\nPayment Information\n\nPayment for the first 4 weeks\r\n$4\n\nPayment every 4 weeks after that\r\n$28\n\nImportant Information\n\nTerms & Conditions\n\nTHINGS YOU NEED TO KNOW\n\nFull Digital Access $4 charged for the first 4 weeks, then $28 charged every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. New customers only. Prices after the introductory pricing period may be varied as per full Terms and Conditions. See www.themercury.com.au/subscriptionterms for full details.\n\nTERMS AND CONDITIONS\n\nOoops, an error has occurred!\n\nPlease call us on 1800 070 535 and we’ll help resolve the issue or try again later.\n\nGo back to subscription packages\n\nhere.\n\nAny Questions? Please call 1800 070 535. Monday to Friday 7:30am – 6:00pm, Saturday & Sunday 7:00am – 11:30am (AEST)"]]